{
  "metadata": {
    "format": "mlx"
  },
  "weight_map": {
    "lm_head.biases": "resident.safetensors",
    "lm_head.scales": "resident.safetensors",
    "lm_head.weight": "resident.safetensors",
    "model.embed_tokens.biases": "resident.safetensors",
    "model.embed_tokens.scales": "resident.safetensors",
    "model.embed_tokens.weight": "resident.safetensors",
    "model.layers.0.input_layernorm.weight": "resident.safetensors",
    "model.layers.0.linear_attn.A_log": "resident.safetensors",
    "model.layers.0.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.0.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.0.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.0.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.0.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.0.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.0.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.0.mlp.gate.biases": "resident.safetensors",
    "model.layers.0.mlp.gate.scales": "resident.safetensors",
    "model.layers.0.mlp.gate.weight": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.0.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.0.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.0.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.0.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.1.input_layernorm.weight": "resident.safetensors",
    "model.layers.1.linear_attn.A_log": "resident.safetensors",
    "model.layers.1.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.1.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.1.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.1.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.1.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.1.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.1.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.1.mlp.gate.biases": "resident.safetensors",
    "model.layers.1.mlp.gate.scales": "resident.safetensors",
    "model.layers.1.mlp.gate.weight": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.1.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.1.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.1.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.1.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.10.input_layernorm.weight": "resident.safetensors",
    "model.layers.10.linear_attn.A_log": "resident.safetensors",
    "model.layers.10.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.10.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.10.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.10.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.10.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.10.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.10.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.10.mlp.gate.biases": "resident.safetensors",
    "model.layers.10.mlp.gate.scales": "resident.safetensors",
    "model.layers.10.mlp.gate.weight": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.10.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.10.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.10.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.10.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.10.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.11.input_layernorm.weight": "resident.safetensors",
    "model.layers.11.mlp.gate.biases": "resident.safetensors",
    "model.layers.11.mlp.gate.scales": "resident.safetensors",
    "model.layers.11.mlp.gate.weight": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.11.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.11.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.11.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.11.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.11.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.11.self_attn.k_norm.weight": "resident.safetensors",
    "model.layers.11.self_attn.k_proj.biases": "resident.safetensors",
    "model.layers.11.self_attn.k_proj.scales": "resident.safetensors",
    "model.layers.11.self_attn.k_proj.weight": "resident.safetensors",
    "model.layers.11.self_attn.o_proj.biases": "resident.safetensors",
    "model.layers.11.self_attn.o_proj.scales": "resident.safetensors",
    "model.layers.11.self_attn.o_proj.weight": "resident.safetensors",
    "model.layers.11.self_attn.q_norm.weight": "resident.safetensors",
    "model.layers.11.self_attn.q_proj.biases": "resident.safetensors",
    "model.layers.11.self_attn.q_proj.scales": "resident.safetensors",
    "model.layers.11.self_attn.q_proj.weight": "resident.safetensors",
    "model.layers.11.self_attn.v_proj.biases": "resident.safetensors",
    "model.layers.11.self_attn.v_proj.scales": "resident.safetensors",
    "model.layers.11.self_attn.v_proj.weight": "resident.safetensors",
    "model.layers.12.input_layernorm.weight": "resident.safetensors",
    "model.layers.12.linear_attn.A_log": "resident.safetensors",
    "model.layers.12.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.12.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.12.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.12.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.12.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.12.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.12.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.12.mlp.gate.biases": "resident.safetensors",
    "model.layers.12.mlp.gate.scales": "resident.safetensors",
    "model.layers.12.mlp.gate.weight": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.12.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.12.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.12.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.12.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.12.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.13.input_layernorm.weight": "resident.safetensors",
    "model.layers.13.linear_attn.A_log": "resident.safetensors",
    "model.layers.13.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.13.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.13.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.13.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.13.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.13.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.13.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.13.mlp.gate.biases": "resident.safetensors",
    "model.layers.13.mlp.gate.scales": "resident.safetensors",
    "model.layers.13.mlp.gate.weight": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.13.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.13.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.13.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.13.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.13.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.14.input_layernorm.weight": "resident.safetensors",
    "model.layers.14.linear_attn.A_log": "resident.safetensors",
    "model.layers.14.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.14.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.14.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.14.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.14.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.14.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.14.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.14.mlp.gate.biases": "resident.safetensors",
    "model.layers.14.mlp.gate.scales": "resident.safetensors",
    "model.layers.14.mlp.gate.weight": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.14.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.14.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.14.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.14.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.14.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.15.input_layernorm.weight": "resident.safetensors",
    "model.layers.15.mlp.gate.biases": "resident.safetensors",
    "model.layers.15.mlp.gate.scales": "resident.safetensors",
    "model.layers.15.mlp.gate.weight": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.15.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.15.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.15.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.15.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.15.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.15.self_attn.k_norm.weight": "resident.safetensors",
    "model.layers.15.self_attn.k_proj.biases": "resident.safetensors",
    "model.layers.15.self_attn.k_proj.scales": "resident.safetensors",
    "model.layers.15.self_attn.k_proj.weight": "resident.safetensors",
    "model.layers.15.self_attn.o_proj.biases": "resident.safetensors",
    "model.layers.15.self_attn.o_proj.scales": "resident.safetensors",
    "model.layers.15.self_attn.o_proj.weight": "resident.safetensors",
    "model.layers.15.self_attn.q_norm.weight": "resident.safetensors",
    "model.layers.15.self_attn.q_proj.biases": "resident.safetensors",
    "model.layers.15.self_attn.q_proj.scales": "resident.safetensors",
    "model.layers.15.self_attn.q_proj.weight": "resident.safetensors",
    "model.layers.15.self_attn.v_proj.biases": "resident.safetensors",
    "model.layers.15.self_attn.v_proj.scales": "resident.safetensors",
    "model.layers.15.self_attn.v_proj.weight": "resident.safetensors",
    "model.layers.16.input_layernorm.weight": "resident.safetensors",
    "model.layers.16.linear_attn.A_log": "resident.safetensors",
    "model.layers.16.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.16.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.16.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.16.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.16.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.16.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.16.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.16.mlp.gate.biases": "resident.safetensors",
    "model.layers.16.mlp.gate.scales": "resident.safetensors",
    "model.layers.16.mlp.gate.weight": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.16.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.16.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.16.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.16.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.16.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.17.input_layernorm.weight": "resident.safetensors",
    "model.layers.17.linear_attn.A_log": "resident.safetensors",
    "model.layers.17.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.17.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.17.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.17.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.17.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.17.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.17.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.17.mlp.gate.biases": "resident.safetensors",
    "model.layers.17.mlp.gate.scales": "resident.safetensors",
    "model.layers.17.mlp.gate.weight": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.17.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.17.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.17.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.17.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.17.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.18.input_layernorm.weight": "resident.safetensors",
    "model.layers.18.linear_attn.A_log": "resident.safetensors",
    "model.layers.18.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.18.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.18.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.18.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.18.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.18.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.18.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.18.mlp.gate.biases": "resident.safetensors",
    "model.layers.18.mlp.gate.scales": "resident.safetensors",
    "model.layers.18.mlp.gate.weight": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.18.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.18.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.18.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.18.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.18.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.19.input_layernorm.weight": "resident.safetensors",
    "model.layers.19.mlp.gate.biases": "resident.safetensors",
    "model.layers.19.mlp.gate.scales": "resident.safetensors",
    "model.layers.19.mlp.gate.weight": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.19.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.19.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.19.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.19.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.19.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.19.self_attn.k_norm.weight": "resident.safetensors",
    "model.layers.19.self_attn.k_proj.biases": "resident.safetensors",
    "model.layers.19.self_attn.k_proj.scales": "resident.safetensors",
    "model.layers.19.self_attn.k_proj.weight": "resident.safetensors",
    "model.layers.19.self_attn.o_proj.biases": "resident.safetensors",
    "model.layers.19.self_attn.o_proj.scales": "resident.safetensors",
    "model.layers.19.self_attn.o_proj.weight": "resident.safetensors",
    "model.layers.19.self_attn.q_norm.weight": "resident.safetensors",
    "model.layers.19.self_attn.q_proj.biases": "resident.safetensors",
    "model.layers.19.self_attn.q_proj.scales": "resident.safetensors",
    "model.layers.19.self_attn.q_proj.weight": "resident.safetensors",
    "model.layers.19.self_attn.v_proj.biases": "resident.safetensors",
    "model.layers.19.self_attn.v_proj.scales": "resident.safetensors",
    "model.layers.19.self_attn.v_proj.weight": "resident.safetensors",
    "model.layers.2.input_layernorm.weight": "resident.safetensors",
    "model.layers.2.linear_attn.A_log": "resident.safetensors",
    "model.layers.2.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.2.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.2.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.2.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.2.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.2.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.2.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.2.mlp.gate.biases": "resident.safetensors",
    "model.layers.2.mlp.gate.scales": "resident.safetensors",
    "model.layers.2.mlp.gate.weight": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.2.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.2.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.2.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.2.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.2.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.20.input_layernorm.weight": "resident.safetensors",
    "model.layers.20.linear_attn.A_log": "resident.safetensors",
    "model.layers.20.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.20.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.20.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.20.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.20.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.20.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.20.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.20.mlp.gate.biases": "resident.safetensors",
    "model.layers.20.mlp.gate.scales": "resident.safetensors",
    "model.layers.20.mlp.gate.weight": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.20.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.20.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.20.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.20.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.20.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.21.input_layernorm.weight": "resident.safetensors",
    "model.layers.21.linear_attn.A_log": "resident.safetensors",
    "model.layers.21.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.21.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.21.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.21.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.21.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.21.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.21.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.21.mlp.gate.biases": "resident.safetensors",
    "model.layers.21.mlp.gate.scales": "resident.safetensors",
    "model.layers.21.mlp.gate.weight": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.21.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.21.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.21.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.21.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.21.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.22.input_layernorm.weight": "resident.safetensors",
    "model.layers.22.linear_attn.A_log": "resident.safetensors",
    "model.layers.22.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.22.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.22.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.22.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.22.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.22.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.22.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.22.mlp.gate.biases": "resident.safetensors",
    "model.layers.22.mlp.gate.scales": "resident.safetensors",
    "model.layers.22.mlp.gate.weight": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.22.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.22.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.22.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.22.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.22.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.23.input_layernorm.weight": "resident.safetensors",
    "model.layers.23.mlp.gate.biases": "resident.safetensors",
    "model.layers.23.mlp.gate.scales": "resident.safetensors",
    "model.layers.23.mlp.gate.weight": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.23.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.23.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.23.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.23.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.23.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.23.self_attn.k_norm.weight": "resident.safetensors",
    "model.layers.23.self_attn.k_proj.biases": "resident.safetensors",
    "model.layers.23.self_attn.k_proj.scales": "resident.safetensors",
    "model.layers.23.self_attn.k_proj.weight": "resident.safetensors",
    "model.layers.23.self_attn.o_proj.biases": "resident.safetensors",
    "model.layers.23.self_attn.o_proj.scales": "resident.safetensors",
    "model.layers.23.self_attn.o_proj.weight": "resident.safetensors",
    "model.layers.23.self_attn.q_norm.weight": "resident.safetensors",
    "model.layers.23.self_attn.q_proj.biases": "resident.safetensors",
    "model.layers.23.self_attn.q_proj.scales": "resident.safetensors",
    "model.layers.23.self_attn.q_proj.weight": "resident.safetensors",
    "model.layers.23.self_attn.v_proj.biases": "resident.safetensors",
    "model.layers.23.self_attn.v_proj.scales": "resident.safetensors",
    "model.layers.23.self_attn.v_proj.weight": "resident.safetensors",
    "model.layers.24.input_layernorm.weight": "resident.safetensors",
    "model.layers.24.linear_attn.A_log": "resident.safetensors",
    "model.layers.24.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.24.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.24.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.24.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.24.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.24.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.24.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.24.mlp.gate.biases": "resident.safetensors",
    "model.layers.24.mlp.gate.scales": "resident.safetensors",
    "model.layers.24.mlp.gate.weight": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.24.mlp.shared_expert.up_proj.weight": "resident.safetensors",
    "model.layers.24.mlp.shared_expert_gate.biases": "resident.safetensors",
    "model.layers.24.mlp.shared_expert_gate.scales": "resident.safetensors",
    "model.layers.24.mlp.shared_expert_gate.weight": "resident.safetensors",
    "model.layers.24.post_attention_layernorm.weight": "resident.safetensors",
    "model.layers.25.input_layernorm.weight": "resident.safetensors",
    "model.layers.25.linear_attn.A_log": "resident.safetensors",
    "model.layers.25.linear_attn.conv1d.weight": "resident.safetensors",
    "model.layers.25.linear_attn.dt_bias": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_a.biases": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_a.scales": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_a.weight": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_b.biases": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_b.scales": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_b.weight": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_qkv.biases": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_qkv.scales": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_qkv.weight": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_z.biases": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_z.scales": "resident.safetensors",
    "model.layers.25.linear_attn.in_proj_z.weight": "resident.safetensors",
    "model.layers.25.linear_attn.norm.weight": "resident.safetensors",
    "model.layers.25.linear_attn.out_proj.biases": "resident.safetensors",
    "model.layers.25.linear_attn.out_proj.scales": "resident.safetensors",
    "model.layers.25.linear_attn.out_proj.weight": "resident.safetensors",
    "model.layers.25.mlp.gate.biases": "resident.safetensors",
    "model.layers.25.mlp.gate.scales": "resident.safetensors",
    "model.layers.25.mlp.gate.weight": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.down_proj.biases": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.down_proj.scales": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.down_proj.weight": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.gate_proj.biases": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.gate_proj.scales": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.gate_proj.weight": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.up_proj.biases": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.up_proj.scales": "resident.safetensors",
    "model.layers.25.mlp.shared_expert.up_proj.weight": "resident.safetensors",
